import React from "react";
import AboutUsCard from "../components/AboutUs/AboutUsCard";
import WhyUsCard from "../components/AboutUs/WhyUsCard";

let CardsData = [
  // Who Are We Section
  {
    icon: "/svgs/icons/Vector.svg",
    title: "نقدم افضل الدورات المجانية",
    description:
      "نحن نعمل علي العديد من الاشياء التي تجعل تجربتك لا مثيل لها, لتحصل علي المزيد من راحة البال و الرضي عند الشراء. نحن نعمل علي العديد من الاشياء التي تجعل",
  },
  {
    icon: "/svgs/icons/Vector.svg",
    title: "المنصة الاولي في مجالها في الوطن العربي",
    description:
      "نحن نعمل علي العديد من الاشياء التي تجعل تجربتك لا مثيل لها, لتحصل علي المزيد من راحة البال و الرضي عند الشراء. نحن نعمل علي العديد من الاشياء التي تجعل",
  },
  {
    icon: "/svgs/icons/Vector.svg",
    title: "منصة متنوعة الدورات",
    description:
      "نحن نعمل علي العديد من الاشياء التي تجعل تجربتك لا مثيل لها, لتحصل علي المزيد من راحة البال و الرضي عند الشراء. نحن نعمل علي العديد من الاشياء التي تجعل",
  },

  // ----- Our Services - 3, 9 -----
  {
    icon: "/svgs/icons/Vector.svg",
    title: "الدورات القصيرة",
    description:
      "لدينا مجموعة متميزة ومتنوعة من الدورات القصيرة والاحترافية والتي توفر فرصًا هائلة للتطوير المهني والشخصي، وتُمكّن الأفراد من اكتساب مهارات جديدة، ومواكبة التطورات في سوق العمل، وتعزيز فرص التوظيف. حيث تتميز هذه الدورات بالمرونة في التعلم، وتمكين المتعلمين من الوصول للمعرفة في أي وقت ومن أي مكان، وفي المجالات التالية: تكنولوجيا المعلومات والأمن السيبراني- الإدارة والمال والأعمال – القانون- الضيافة والفندقة – اللغة الإنجليزية"
  },
  {
    icon: "/svgs/icons/Vector.svg",
    title: "الاختبارات الدولية",
    description:
      "الأكاديمية مركز اختبارات معتمد من خلال شراكات متعددة لعقد وتنفيذ الاختبارات الدولية في مجالات كثيرة ومتنوعة منها (تكنولوجيا المعلومات والأمن السيبراني- الإدارة والمال والأعمال – القانون- الضيافة والفندقة- اللغة الانجليزية)، مما يمنح للمتدربين الحصول على الشهادة الاحترافية الدولية بسهولة ويسر",
  },
  {
    icon: "/svgs/icons/Vector.svg",
    title: "الشهادات الاحترافية",
    description:
      "تضم أكاديمية المهارات التطبيقية عديد من الشهادات الاحترافية المهنية والتي تعزز فرص الالتحاق بسوق العمل والحصول على وظيفية مناسبة لمهاراتك وقدراتك المهنية، وتساعدك على التطوير المهني والترقي في مجالات كثيرة منها (تكنولوجيا المعلومات والأمن السيبراني- الإدارة والمال والأعمال – القانون- الضيافة والفندقة- اللغة الانجليزية)",
  },
  {
    icon: "/svgs/icons/Vector.svg",
    title: "الدبلومات المهنية",
    description:
      "لدى الأكاديمية مجموعة متنوعة من الدبلومات المهنية الاحترافية والتي تم اختيارها بدقة فائقة لتناسب احتياجاتك المهنية والوظيفية، كما تتميز هذه الدبلومات بالمرونة والتنظيم حيث يمكن الحصول على دبلوم مشارك، أو دبلوم متوسط أو استكمال الدراسة للحصول على البكالوريوس، كما توفر هذه الدبلومات نقاطاً للخروج ونظاماً واضحاً للتجسير يتيح للمتدرب إمكانية وسهولة الخروج من الدبلوم والحصول على شهادة احترافية مهنية واستكماله فيما بعد أو الالتحاق بدبلوم آخر",
  },
  {
    icon: "/svgs/icons/Vector.svg",
    title: "الحلول والاستشارات",
    description:
      "لدى الاكاديمية نخبة مميزة من الاستشاريين لتحديد الاحتياجات التدريبية للأفراد والمؤسسات وتقديم الحلول التدريبية والاستشارات الفنية، وتصميم برامج تدريبية مخصصة، وتقديم الدعم والمتابعة لتحقيق أهدافهم وتعزيز مهاراتهم وكفاءاتهم، مما يؤدي إلى تحسين الأداء وزيادة الإنتاجية",
  },
  {
    icon: "/svgs/icons/Vector.svg",
    title: "الحقائب التدريبية",
    description:
      "لدى الاكاديمية فريق متخصص في إعداد وتصميم وتطوير الحقائب التدريبية المتكاملة وفقاً لأحدث المعايير الدولية والتي تلبي احتياجات الافراد والمؤسسات، وتتميز بأنها مرنة وقابلة للتخصيص والتحديث لتلبية الاحتياجات المتغيرة",
  },

  // ------ 9, 16 - Why Us ------ 
  {
    icon: "/svgs/icons/mdi_engine-outline.svg",
    title: "الشراكات الدولية والإقليمية",
    description:
      "الأكاديمية الأولى والرائدة في عقد الشراكات الدولية مع الجهات التدريبية الدولية والإقليمية.",
  },
  {
    icon: "/svgs/icons/mdi_engine-outline.svg",
    title: "مركز اختبارات معتمد",
    description:
      "نوفر لك الوقت والجهد والمال من خلال الالتحاق بالاختبارات الدولية لدينا.",
  },
  {
    icon: "/svgs/icons/mdi_engine-outline.svg",
    title: "التركيز على المهارات",
    description:
      "تتيح فرصًا للتطبيق العملي والتدريب الميداني والمحاكاة لتعزيز فهم المتدربين لبيئة العمل واكتساب المهارات بسهولة ويسر.",
  },
  {
    icon: "/svgs/icons/mdi_engine-outline.svg",
    title: "محتوى تدريبي متميز",
    description:
      "تصميم الحقائب التدريبية والمقررات لتناسب متطلبات سوق العمل واحتياجات الأفراد والمؤسسات.",
  },{
    icon: "/svgs/icons/mdi_engine-outline.svg",
    title: "فريق عمل متخصص",
    description:
      "تضم الأكاديمية فريقًا متخصصًا من الخبراء المحليين والدوليين والمدربين المتخصصين في مختلف المسارات المهنية والبرامج التدريبية.",
  },{
    icon: "/svgs/icons/mdi_engine-outline.svg",
    title: "خدمة عملاء مميزة",
    description:
      "تتميز الأكاديمية بقنوات اتصال جيدة وفعالة مع عملائها لتلبية احتياجاتهم من خلال بيئة تدريبية ديناميكية تعزز من جودة المخرجات وكفاءة الأداء.",
  },
];


export default function AboutUs() {
  return (
    <>
      {/* WHo Are We Section */}
      <div className="container max-w-[1300px] mx-auto flex flex-col items-center justify-center px-2 bg-white overflow-x-hidden">
        <h1 className="text-[24px] font-bold mt-10 mb-5">من نحن؟</h1>
        <h1 className="text-2xl my-10 text-justify leading-relaxed">
          أكاديمية المهارات التطبيقية للتدريب (ASTA) أكاديمية رائدة في مجال
          التدريب والاستشارات المتنوعة ومتخصصة في تقديم البرامج التدريبية
          للشهادات الاحترافية المهنية الدولية، والدورات القصيرة والدبلومات
          المهنية وعقد وتنفيذ الاختبارات الدولية المختلفة من خلال الشراكات
          الاستراتيجية الدولية. تقوم فلسفة التدريب في أكاديمية المهارات
          التطبيقية للتدريب (ASTA) على الجودة والاحترافية والابتكارية في تصميم
          البرامج التدريبية والدبلومات المهنية وعقد وتنفيذ الاختبارات الدولية
          بدقة عالية لتتوافق مع أفضل الممارسات العالمية وتزويد المتدربين
          بالمهارات والمعرفة التي يحتاجون إليها لمواجهة التحديات المعاصرة من
          خلال مدربين أكفاء ومتخصصين.
        </h1>
        {/* Services Section */}
        <h1 className="text-[24px] font-bold mt-10 mb-5">خدماتنا</h1>
        <div className="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-4 mb-6">
          {CardsData.slice(3, 9).map((item, index) => (
            <AboutUsCard
              key={index}
              icon={item.icon}
              title={item.title}
              description={item.description}
            />
          ))}
        </div>
        <h1 className="text-2xl mt-10 mb-5 text-justify leading-relaxed">
          هدفنا ان نكون المنصة التعليمية الرائدة في المملكة العربية السعودية
          التي تمكّن الطلبة والباحثين من اكتساب المعرفة والمهارات الحديثة عبر
          بيئة تعليمية رقمية مبتكرة، تواكب احتياجات سوق العمل وتسهم في بناء
          مجتمع معرفي متطور.
        </h1>
        {/* Why Us Section */}
        <h1 className="text-[24px] font-bold my-10">لماذا نحن؟</h1>
        <div className="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-4 mb-6">
          {CardsData.slice(9, 16).map((item, index) => (
            <WhyUsCard
              key={index}
              icon={item.icon}
              title={item.title}
              description={item.description}
            />
          ))}
        </div>
      </div>
    </>
  );
}
